import numpy as np

a = np.array([[1,2,3,4,5,6,7,8,9,10],
              [9,8,7,6,5,4,3,2,1,0]]).T
print(a)
#   x1  x2
#  삼성 온도
# [[ 1  9]
#  [ 2  8]
#  [ 3  7]
#  [ 4  6]
#  [ 5  5]
#  [ 6  4]
#  [ 7  3]
#  [ 8  2]
#  [ 9  1]
#  [10  0]]
print(a.shape) # (10, 2)

def split_x(dataset, size):
    aaa = []
    for i in range(len(dataset) - size + 1): # 10-3+1 = range(0, 8)
        subset = dataset[i : (i+size)]
        aaa.append(subset)
    return np.array(aaa)


# 시계열 데이터 만들기
bbb = split_x(a, 5)
print(bbb)
# [[[ 1  9]
#   [ 2  8]
#   [ 3  7]
#   [ 4  6]
#   [ 5  5]]

#  [[ 2  8]
#   [ 3  7]
#   [ 4  6]
#   [ 5  5]
#   [ 6  4]]

#  [[ 3  7]
#   [ 4  6]
#   [ 5  5]
#   [ 6  4]
#   [ 7  3]]

#  [[ 4  6]
#   [ 5  5]
#   [ 6  4]
#   [ 7  3]
#   [ 8  2]]

#  [[ 5  5]
#   [ 6  4]
#   [ 7  3]
#   [ 8  2]
#   [ 9  1]]

#  [[ 6  4]
#   [ 7  3]
#   [ 8  2]
#   [ 9  1]
#   [10  0]]]
print(bbb.shape) # (6, 5, 2)


# x와 y 분리하기
# x = bbb[:, :-1, :] # 마지막 인덱스가 전체 데이터면 생략 가능
x = bbb[:, :-1]
# y = bbb[:, -1, 1]
y = bbb[:, -1, -1]
print(x)
# [[[1 9]
#   [2 8]
#   [3 7]
#   [4 6]]

#  [[2 8]
#   [3 7]
#   [4 6]
#   [5 5]]

#  [[3 7]
#   [4 6]
#   [5 5]
#   [6 4]]

#  [[4 6]
#   [5 5]
#   [6 4]
#   [7 3]]

#  [[5 5]
#   [6 4]
#   [7 3]
#   [8 2]]

#  [[6 4]
#   [7 3]
#   [8 2]
#   [9 1]]]
print(x.shape) # (6, 4, 2)
print(y) # [5 4 3 2 1 0]
print(y.shape) # (6,)


